# Lab | Data Structuring and Combining Data

## Challenge 1: Combining & Cleaning Data

In this challenge, we will be working with the customer data from an insurance company, as we did in the two previous labs. The data can be found here:
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

But this time, we got new data, which can be found in the following 2 CSV files located at the links below.

- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv

Note that you'll need to clean and format the new data.

Observation:
- One option is to first combine the three datasets and then apply the cleaning function to the new combined dataset
- Another option would be to read the clean file you saved in the previous lab, and just clean the two new files and concatenate the three clean datasets

In [1]:
import pandas as pd

In [2]:
df1 = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv")
df2 = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv")
df3 = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv")

In [31]:
df1.head(2)
df1.isnull().sum()

customer                     2937
state                        2937
gender                       3054
education                    2937
customer_lifetime_value      2940
income                       2937
monthly_premium_auto         2937
number_of_open_complaints    2937
policy_type                  2937
vehicle_class                2937
total_claim_amount           2937
dtype: int64

In [32]:
df2.head(2)
df2.isnull().sum()

customer                     0
state                        0
gender                       5
education                    0
customer_lifetime_value      4
income                       0
monthly_premium_auto         0
number_of_open_complaints    0
total_claim_amount           0
policy_type                  0
vehicle_class                0
dtype: int64

In [5]:
df3.head(2)

,Customer,State,Customer Lifetime Value,Education,Gender,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Total Claim Amount,Vehicle Class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.200000,Two-Door Car
1,TB86706,Arizona,2502.637401,Master,M,0,66,0,Personal Auto,3.468912,Two-Door Car

In [33]:
df3.isnull().sum()

customer                     0
state                        0
customer_lifetime_value      0
education                    0
gender                       0
income                       0
monthly_premium_auto         0
number_of_open_complaints    0
policy_type                  0
total_claim_amount           0
vehicle_class                0
dtype: int64

In [6]:
df1.columns = [col.lower().replace(' ', '_') for col in df1.columns]
df1.rename(columns={'st': 'state'}, inplace=True)

In [7]:
df2.columns = [col.lower().replace(' ', '_') for col in df2.columns]
df2.rename(columns={'st': 'state'}, inplace=True)

In [8]:
df3.columns = [col.lower().replace(' ', '_') for col in df3.columns]

In [9]:
df_combined= pd.concat([df1, df2, df3])

In [10]:
df_combined.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [11]:
df_combined.shape

(12074, 11)

In [12]:
df_combined['gender'].unique()

array([nan, 'F', 'M', 'Femal', 'Male', 'female'], dtype=object)

In [13]:
corrections = {'Femal': 'F', 'Male':'M', 'female':'F'}
df_combined['gender']=df_combined['gender'].replace(corrections)

In [14]:
df_combined['state'].value_counts()

state
California    3032
Oregon        2601
Arizona       1630
Nevada         882
Washington     768
Cali           120
AZ              74
WA              30
Name: count, dtype: int64

In [15]:
# Fixing the 'state' column
st_corrections = {'WA': 'Washington', 'AZ':'Arizona', 'Cali':'California'}
df_combined['state']=df_combined['state'].replace(st_corrections)

In [16]:
df_combined['education'].value_counts()

education
Bachelor                2719
College                 2682
High School or Below    2616
Master                   752
Doctor                   344
Bachelors                 24
Name: count, dtype: int64

In [17]:
# Fixing the 'education' column
ed_corrections = {'Bachelors': 'Bachelor'}
df_combined['education']=df_combined['education'].replace(ed_corrections)

In [18]:
# Converting 'customer_lifetime_value' from % to float

df_combined['customer_lifetime_value'] = df_combined['customer_lifetime_value'].str.strip('%').astype(float)

In [19]:
df_combined['customer_lifetime_value'] = df_combined['customer_lifetime_value']/100

In [20]:
# Converting 'Luxury SUV' and 'Luxury Car' vehicle class to 'Luxury'
conversion = {'Luxury SUV': 'Luxury', 'Luxury Car':'Luxury'}
df_combined['vehicle_class']=df_combined['vehicle_class'].replace(conversion)

In [21]:
df_combined['vehicle_class'].value_counts()

vehicle_class
Four-Door Car    4641
Two-Door Car     1896
SUV              1774
Sports Car        483
Luxury            343
Name: count, dtype: int64

In [28]:
df_combined['number_of_open_complaints'].value_counts()

number_of_open_complaints
0.0    7255
1.0    1012
2.0     376
3.0     290
4.0     148
5.0      56
Name: count, dtype: int64

In [26]:
df_combined['number_of_open_complaints'] = df_combined['number_of_open_complaints'].apply(lambda x: x.split('/')[1] if isinstance(x, str) else x)

In [27]:
df_combined['number_of_open_complaints'] = df_combined['number_of_open_complaints'].apply(lambda x: int(x) if isinstance(x, str) else x)

In [ ]:
df_combined.shape

In [29]:
df_combined.isnull().sum()

customer                      2937
state                         2937
gender                        3059
education                     2937
customer_lifetime_value      10014
income                        2937
monthly_premium_auto          2937
number_of_open_complaints     2937
policy_type                   2937
vehicle_class                 2937
total_claim_amount            2937
dtype: int64

# Challenge 2: Structuring Data

In this challenge, we will continue to work with customer data from an insurance company, but we will use a dataset with more columns, called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by performing data cleaning, formatting, and structuring.

In [34]:
df = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv")
df.head()

,unnamed:_0,customer,state,customer_lifetime_value,response,coverage,education,effective_to_date,employmentstatus,gender,...,number_of_policies,policy_type,policy,renew_offer_type,sales_channel,total_claim_amount,vehicle_class,vehicle_size,vehicle_type,month
0,0,DK49336,Arizona,4809.216960,No,Basic,College,2011-02-18,Employed,M,...,9,Corporate Auto,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,A,2
1,1,KX64629,California,2228.525238,No,Basic,College,2011-01-18,Unemployed,F,...,1,Personal Auto,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,A,1
2,2,LZ68649,Washington,14947.917300,No,Basic,Bachelor,2011-02-10,Employed,M,...,2,Personal Auto,Personal L3,Offer3,Call Center,480.000000,SUV,Medsize,A,2
3,3,XL78013,Oregon,22332.439460,Yes,Extended,College,2011-01-11,Employed,M,...,2,Corporate Auto,Corporate L3,Offer2,Branch,484.013411,Four-Door Car,Medsize,A,1
4,4,QA50777,Oregon,9025.067525,No,Premium,Bachelor,2011-01-17,Medical Leave,F,...,7,Personal Auto,Personal L2,Offer1,Branch,707.925645,Four-Door Car,Medsize,A,1

In [44]:
df.columns

Index(['unnamed:_0', 'customer', 'state', 'customer_lifetime_value',
       'response', 'coverage', 'education', 'effective_to_date',
       'employmentstatus', 'gender', 'income', 'location_code',
       'marital_status', 'monthly_premium_auto', 'months_since_last_claim',
       'months_since_policy_inception', 'number_of_open_complaints',
       'number_of_policies', 'policy_type', 'policy', 'renew_offer_type',
       'sales_channel', 'total_claim_amount', 'vehicle_class', 'vehicle_size',
       'vehicle_type', 'month'],
      dtype='object')

1. You work at the marketing department and you want to know which sales channel brought the most sales in terms of total revenue. Using pivot, create a summary table showing the total revenue for each sales channel (branch, call center, web, and mail).
Round the total revenue to 2 decimal points.  Analyze the resulting table to draw insights.

In [38]:
# I do not see a revenue column so I will use cusomter_lifetime_value
table = pd.pivot_table(df, values='customer_lifetime_value', index='sales_channel', aggfunc='sum')
table['customer_lifetime_value'] = table['customer_lifetime_value'].round(2)
table

               customer_lifetime_value
sales_channel
Agent                      33057887.85
Branch                     24359201.21
Call Center                17364288.37
Web                        12697632.90

2. Create a pivot table that shows the average customer lifetime value per gender and education level. Analyze the resulting table to draw insights.

In [46]:
table1 = pd.pivot_table(df, values='customer_lifetime_value', index=['gender', 'education'], aggfunc='mean')
table1

                             customer_lifetime_value
gender education
F      Bachelor                          7874.269478
       College                           7748.823325
       Doctor                            7328.508916
       High School or Below              8675.220201
       Master                            8157.053154
M      Bachelor                          7703.601675
       College                           8052.459288
       Doctor                            7415.333638
       High School or Below              8149.687783
       Master                            8168.832659

## Bonus

You work at the customer service department and you want to know which months had the highest number of complaints by policy type category. Create a summary table showing the number of complaints by policy type and month.
Show it in a long format table.

*In data analysis, a long format table is a way of structuring data in which each observation or measurement is stored in a separate row of the table. The key characteristic of a long format table is that each column represents a single variable, and each row represents a single observation of that variable.*

*More information about long and wide format tables here: https://www.statology.org/long-vs-wide-data/*

In [53]:
summary_table = df[['policy_type', 'month', 'number_of_open_complaints']].groupby(['policy_type', 'month']).count().reset_index()

In [54]:
long_format_table = pd.melt(summary_table, id_vars=['policy_type', 'month'], value_vars=['number_of_open_complaints'],
                            var_name='Complaint_Type', value_name='Number_of_Complaints')

In [55]:
long_format_table

      policy_type  month             Complaint_Type  Number_of_Complaints
0  Corporate Auto      1  number_of_open_complaints                  1252
1  Corporate Auto      2  number_of_open_complaints                  1089
2   Personal Auto      1  number_of_open_complaints                  4329
3   Personal Auto      2  number_of_open_complaints                  3799
4    Special Auto      1  number_of_open_complaints                   237
5    Special Auto      2  number_of_open_complaints                   204